{
  "id": "hex-grid",
  "titleShort": "Hex Grid",
  "titleLong": "Hex Grid",
  "urls": {
    "demo": "http://levi.codes/hex-grid",
    "github": "https://github.com/levilindsey/hex-grid"
  },
  "jobTitle": "",
  "location": "",
  "date": {
    "start": "7/2014",
    "end": "1/2015"
  },
  "categories": [
    "side-project",
    "web",
    "frontend",
    "svg",
    "canvas",
    "animation",
    "library",
    "app",
    "data-driven",
    "dat.gui",
    "gulp.js"
  ],
  "images": [
    {
      "fileName": "screenshot1.png",
      "description": "This shows the hex-grid layout containing many of Levi's posts at random positions. This also captures a \"lightning\" animation in progress."
    },
    {
      "fileName": "screenshot2.png",
      "description": "This shows the grid layout in its expanded form. After clicking on a tile with a post, the grid expands around that tile in order to show an enlarged panel with details about the post."
    },
    {
      "fileName": "screenshot3.png",
      "description": "A dat.GUI menu makes most of the parameters in hex-grid dynamically configurable by the user. This is great for debugging, tuning, and playing around."
    },
    {
      "fileName": "screenshot4.png",
      "description": "This shows the hex-grid layout containing many of Levi's posts at random positions."
    },
    {
      "fileName": "hg-sector-expansion-1.png",
      "description": "This illustrates how the grid is expanded in order to show an enlarged area with details for a given tile. The grid is divided into six sectors around the given tile. These are then each translated in a different direction."
    },
    {
      "fileName": "hg-sector-expansion-2.png",
      "description": "This illustrates which tile positions lie within the viewport after both the grid has been expanded and panning has occurred in order to center the viewport on the expanded tile. This also illustrates where new tiles will need to be created in order to not show gaps within the expanded grid."
    },
    {
      "fileName": "hg-indices.png",
      "description": "This illustrates how the hex-grid system stores data for three different types of tile relationships. For each of these relationships, both the vertical and horizontal grid configurations are illustrated."
    }
  ],
  "videos": [],
  "content": ""
}